app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [[nil, 1]]
---
  <ul>
  <% @post.comments.reload.each do |comment| %>