app/controllers/categories_controller.rb

  def create
    @category = Category.new(params.require(:category).permit(:name))
    if @category.save
---
INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 07 Oct 2013 20:19:19 UTC +00:00], ["name", "Ruby "], ["updated_at", Mon, 07 Oct 2013 20:19:19 UTC +00:00]]