app/controllers/comments_controller.rb

def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.new(comment_params)
    @comment.user = current_user

    if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "finish it "], ["created_at", Mon, 07 Oct 2013 21:06:03 UTC +00:00], ["post_id", 1], ["updated_at", Mon, 07 Oct 2013 21:06:03 UTC +00:00], ["user_id", 1]]

def vote
    Vote.create(voteable: @comment,  creator: current_user, vote: params[:vote] )
---
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sun, 20 Oct 2013 21:21:42 UTC +00:00], ["updated_at", Sun, 20 Oct 2013 21:21:42 UTC +00:00], ["user_id", 5], ["vote", false], ["voteable_id", 24], ["voteable_type", "Comment"]]