app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."slug" = 'slugify' LIMIT 1
---
def create
    @post = Post.find_by(slug: params[:post_id])