app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @posts = Post.all.sort_by {|x| x.total_votes}.reverse

INSERT INTO "posts" ("created_at", "title", "updated_at", "url") VALUES (?, ?, ?, ?)  [["created_at", Mon, 07 Oct 2013 03:44:09 UTC +00:00], ["title", "strong params "], ["updated_at", Mon, 07 Oct 2013 03:44:09 UTC +00:00], ["url", ""]]
---
  def create
    @post = Post.new(post_params)
    @post.creator = current_user
    if @post.save

UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = 6  [["title", "Week 4 "], ["description", "It will be the last week of 2nd course, Rapid Prototyping"], ["updated_at", Tue, 15 Oct 2013 20:55:27 UTC +00:00]]
---
  def update
    if @post.update(post_params)

INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Fri, 18 Oct 2013 12:57:15 UTC +00:00], ["updated_at", Fri, 18 Oct 2013 12:57:15 UTC +00:00], ["user_id", 5], ["vote", true], ["voteable_id", 2], ["voteable_type", "Post"]]
---
  def vote
    @vote = Vote.create(voteable: @post, creator: current_user, vote: params[:vote] )

SELECT "posts".* FROM "posts" WHERE "posts"."slug" = '-l-a-s-t- -w-e-e-k-' LIMIT 1
---
  def set_post
    @post = Post.find_by(slug: params[:id])