app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "password_digest", "time_zone", "updated_at", "username") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    if @user.save